# 5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

let_index = int(input('Введите индекс буквы '))

print(f'Вавша буква \'{chr(let_index + 96)}\'')
